<?php
function convertMonthToNumber($thaiMonth) {
    $months = [
        "มกราคม" => "01",
        "กุมภาพันธ์" => "02",
        "มีนาคม" => "03",
        "เมษายน" => "04",
        "พฤษภาคม" => "05",
        "มิถุนายน" => "06",
        "กรกฎาคม" => "07",
        "สิงหาคม" => "08",
        "กันยายน" => "09",
        "ตุลาคม" => "10",
        "พฤศจิกายน" => "11",
        "ธันวาคม" => "12"
    ];

    return isset($months[$thaiMonth]) ? $months[$thaiMonth] : "-"; // คืนค่า - ถ้าไม่พบชื่อเดือน
}

function convertMonthToNumberSingle($thaiMonth) {
    $months = [
        "มกราคม" => "1",
        "กุมภาพันธ์" => "2",
        "มีนาคม" => "3",
        "เมษายน" => "4",
        "พฤษภาคม" => "5",
        "มิถุนายน" => "6",
        "กรกฎาคม" => "7",
        "สิงหาคม" => "8",
        "กันยายน" => "9",
        "ตุลาคม" => "10",
        "พฤศจิกายน" => "11",
        "ธันวาคม" => "12"
    ];

    return isset($months[$thaiMonth]) ? $months[$thaiMonth] : "-"; // คืนค่า - ถ้าไม่พบชื่อเดือน
}